In [3]:
import numpy as np
import pandas as pd

In [4]:
url = "https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
df = pd.read_csv(url)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
#creating dataframe/tables with pandas
df = pd.DataFrame({      
    "name": ["A", "B", "C", "D", "E", "F", "G", "H"],
    "score": [90, 85, 88, 86, 78, 92, 85, 66],
})
print(df)

  name  score
0    A     90
1    B     85
2    C     88
3    D     86
4    E     78
5    F     92
6    G     85
7    H     66

In [6]:
df.shape #shape of the dataset

(8, 2)

In [7]:
df.info() #data types

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   score   8 non-null      int64
dtypes: int64(1), object(1)
memory usage: 260.0+ bytes

In [8]:
df.describe() #summary statistics of the datasets

           score
count   8.000000
mean   83.750000
std     8.293715
min    66.000000
25%    83.250000
50%    85.500000
75%    88.500000
max    92.000000

In [9]:
df.name #accessing a column

0    A
1    B
2    C
3    D
4    E
5    F
6    G
7    H
Name: name, dtype: object

In [10]:
df.iloc[0] #accessing a row

name      A
score    90
Name: 0, dtype: object

In [11]:
df[df.score >= 85] #filtering any data

  name  score
0    A     90
1    B     85
2    C     88
3    D     86
5    F     92
6    G     85